define empty = Character(None)

define mc = Character("[mc_name]")

define ayumi = Character("Аюмі")
define akane = Character("Акане")
define rei = Character("Рей")
define yuno = Character("Юно")
define akira = Character("Акіра")

label start:

    $ ayumiaff = 5
    $ akaneaff = 5
    $ reiaff = 5
    $ yunoaff = 5
    $ akiraaff = 5

    $ choosevar = 0 

    jump chapter1_1

    jump chapter1_2

    return

label chapter1_1:

    scene black #mc_info

    python:

        mc_name = renpy.input("Введіть своє ім'я: (стандартне: Славко)", length = 32)
        mc_name = mc_name.strip()

        if not mc_name:
            mc_name = "Славко"

    empty "Студент по обміну з Польщі [mc_name], приїхав до Японії по рекомендації своєї давньої подруги, Куросави Аюмі."
    empty "Дівчина навчається в тому ж університеті, тому саме вона допомогала йому з організацією обміну."
    empty "Зараз [mc_name] прокидається у своєму новому житлі в Японії та вже готовий  до першого дня в новому університеті."
    empty "Він ще не знає нікого, окрім своєї давньої інтернет-подруги."
    empty "Aле вона обіцяла йому познайомити його з декількома своїми одногрупницями."
    empty "Його серце повне надії та очікувань, але він трохи схвильований, що все піде не так як треба."
    empty "[mc_name] чекає багато цікавих пригод та знайомств у своєму новому житті в Японії"

    #1_loc_mc_room
    
    show chap1111 with fade
    pause 1.5

    empty "Ви прокидаєтесь від сповіщення.."

    show chap1112 with fade

    empty "“Я вже на передньому дворику школи! Чекаю на тебе.” \n Аюмі" 

    mc "*Ох, лихо, в мене лише 10 хвилин, щоб не запізнитись..*"

    scene black with fade #2_loc_school_entrance_1

    empty "Ви швидко вибігаєте і біжите на зустріч з Аюмі."

    show chap1121 with fade
    pause 4

    show chap1122 with fade

    ayumi "Привіт, [mc_name], це я Аюмі!"
    mc "Радий тебе бачити! Дивно знайомитись ще раз після стількох років спілкування в інтернеті.."

    show chap1123

    ayumi "Хе-хе~ дійсно дивно, але я дуже рада тебе бачити! Як тобі тут? Ти готовий до навчання?"
    mc "Твоя країна просто дивовижна, але є багато чого незрозумілого.. Було б добре дізнатись щось про культуру та звичаї.."

    show chap1124

    ayumi "Супер!~ Я тобі допоможу влитися в японську культуру та як і обіцяла познайомлю з одногрупниками!"
    ayumi "Ой, подивися, он біля нас стоять мої.. Тобто, наші одногрупниці, Такахасі та Ішіто! Пішли знайомитись!!"

    scene black with fade #2_loc_school_entrance_2

    empty "Ви підходите до своїх нових одногрупниць..."

    show chap1125 with fade

    ayumi "Такахасі-тян, Ішіто-сан!! Знайомтеся, це наш новий одногрупник, [mc_name]!"

    menu:

        "Привіт, як воно?":

            $ akaneaff = akaneaff

        "Привіт, я приїхав з Польщі, сподіваюсь, що зможу з вами подружитись..":

            $ akaneaff -= 5


    if akaneaff > 4:
        akane "Мені здається, що студентам по обміну не варто занадто довго тут залишатись."

    else:

        akane "Мені все одно, звідки ти приїхав.. Мені здається, що студентам по обміну не варто занадто довго тут залишатись."

    show chap1126

    ayumi "Акане завжди була байдужою до всього, але не зважай на неї. "
    ayumi "Ми раді, що ти з нами і допоможемо тобі відчути себе комфортно в нашій країні."

    show chap1127

    rei "Так, Аюмі має рацію. Якщо ти будеш мати якісь питання або потребуватимеш допомоги, просто питай нас."
    mc "*Ого, в Такахасі ніби якась таємнича аура..*"
    mc "Дуже вдячний вам за теплий прийом. Я дуже радий знайомству з вами."
    akane "Я теж рада познайомитись. Тепер, коли ми знайомі, можемо рухатись далі? Я не хочу запізнюватись на урок."

    scene black with fade #2_loc_school_entrance_3

    show chap1128 with fade

    ayumi "Хмм~ Дивно, що ніде немає Юно-тян.. Я ж просила її вийти сюди.."
    ayumi "До речі, як тобі перші знайомства?"
    mc "Мені, здається, що Ішіто не дуже рада нашому знайомству.."

    show chap1129

    ayumi "Не зважай, вона завжди так поводиться, я теж з нею не дуже ладнаю.. "

    show chap11210

    ayumi "О~ Глянь, йде ще одна наша одногрупниця!!"

    show chap11211 with fade

    ayumi "Юно-тян!!"

    menu:

        "Привіт, Юно!":

            $ yunoaff -= 5

        "Привіт, як я можу до тебе звертатись?":

            $ yunoaff += 5

    show chap11212
        
    if yunoaff > 9:

        yuno "Пф, тобі не доведеться до мене звертатись"

    else:

        yuno "Для тебе - Фудзівара-сан"
        
    show chap11213

    ayumi "Ой, перестань! Краще скажи, де ти була?"
    yuno "Мене викликали до директора, тому і запізнилась."

    show chap11214

    ayumi "До директора? Що знову сталося?"

    show chap11215

    yuno "Я йшла сюди, а на сходах якийсь невдаха вирішив позалицятись, хіба я винна, що він не зміг встояти на ногах?"

    show chap11216

    ayumi "Ти що, штовхнула його з сходів?!"

    show chap11217

    yuno "Можеш називати це і так, але не це важливо, знайомство - це все чому ти мене сюди покликала?"

    show chap11218

    ayumi "Ну так, а хіба ще чогось потрібно? "

    show chap11219

    ayumi "Це - мій давній друг [mc_name], я впевнена, що ви зможете подружитись!"
    mc "Я теж хочу сподіватись на це!"

    show chap11220

    yuno "Помовч.. А от тобі, Аюмі-тян, вже саме час запам’ятати моє ставлення до такого!"

    show chap11221

    ayumi "~Юно-тян! Не будь такою злою весь час!"
    ayumi "Ну добре, час бігти на заняття!"

    scene black with fade #3_loc_school_classroom

    empty "*ви зайшли до класу*"
    pause 1.0

    show chap1131 with fade

    akira "Доброго ранку! Сподіваюсь, ви підготувались до заняття!"

    show chap1132

    ayumi "Като-сенсей! У нас новий студент по обміну - мій хороший друг - [mc_name]!! Він.."

    show chap1133

    akira "Припини, Куросава-тян, нехай новенький сам про себе щось розкаже! Мене звати Като-сенсей, я викладаю біологію!"

    show chap1134

    akira "Зараз ми вивчаємо регуляцію функцій організму, сьогодні у нас остання тема - імунні порушення."
    akira "Але для початку, я хочу дізнатись щось про нашого новачка."
    menu:

        "Мене звати [mc_name], я з Польщі. Дякую за теплий прийом!":

            $ akiraaff += 5

        "Ну Аюмі вже все сказала..":

            $ akiraaff -=5

    show chap1135

    ayumi "А ще я познайомила його з одногрупницями!!"

    show chap1136

    akira "Ну добре, тепер продовжимо."
    akira "Нагадаю, що це остання тема, а це означає, що на наступний раз у нас буде тест!"

    scene black with fade

    empty "*ви сіли на своє місце*"
    pause 1.0
    empty "*почався урок*"
    pause 1.0
    empty "..."
    pause 1.0
    empty "..."
    pause 1.0
    empty "..."
    pause 1.0
    empty "*вже стемніло, і закінчився урок*"
    pause 1.0
    empty "*ви з новими друзями обговорюєте урок на виході зі школи*"

    scene black with fade #4_loc_school_entrance

    show chap1_1_4_2 with fade

    mc "Дідько, контрольна на наступний раз? Я ж тільки почав!"

    ayumi "Не хвилюйся, [mc_name]."
    ayumi "Я допоможу тобі підготуватись. Якщо ти хочеш, можемо зустрітись і разом пройти матеріал."

    show chap1_1_4_3

    rei "Мабуть, дійсно варто дати тобі знати, що на нас можна покластись."

    show chap1_1_4_4

    akane "Або ти можеш зробити це самостійно. Немає нічого складного в біології."

    show chap1_1_4_5

    yuno "Чому ви тратите свій час на цього зеленого новачка? Нехай він сам знаходить вихід з цього."

    show chap1_1_4_6

    ayumi "Юно-тяяян, не треба бути такою жорстокою. Ми всі були новачками колись і розуміємо, як це. "
    
    menu:

        "Дякую, Аюмі, я дуже вдячний тобі за допомогу.":

            $ ayumiaff = ayumiaff

        "Можливо.. Вона має рацію, мабуть я сам підготуюсь, щоб вас не турбувати":

            $ yunoaff += 5

    show chap1_1_4_7

    ayumi "Все гаразд, [mc_name]."
    ayumi "Ми з Такахасі-тян можемо зустрітись з тобою завтра і розібрати те, що треба для контрольної. Що ти на це скажеш?"

    show chap1_1_4_8

    rei "Я погоджуюсь. Будемо раді допомогти."

    show chap1_1_4_9

    akane "Ну я можу дати свої нотатки, якщо хочеш.."

    show chap1_1_4_10

    yuno "Або він може просто не йти на контрольну і не турбувати нас своїми питаннями."

    show chap1_1_4_11

    ayumi "Припини, Юно-тян, це точно не вихід! Ми допоможемо тобі підготуватись!"

    show chap1_1_4_12

    ayumi "Я напишу тобі трохи пізніше, [mc_name]!"

    show black_screen with fade

label chapter1_2:

    scene black #1_loc_mc_room

    show chap1_2_1_1 with fade
    pause 2.0

    show chap1_2_1_2 with fade

    empty "“Привіт, вибач, але я не зможу тобі допомогти з підготовкою до тесту."
    empty "У мене є деякі важливі справи. Однак, Рей тобі допоможе! Нижче напишу адресу нашого гуртожитку!”"
    empty "-Аюмі"

    scene black with fade #2_loc_rei_room

    empty "*через деякий час ви вже були в гуртожитку*"
    empty "*ви постукали в двері*"
    empty "*голос Рей*"
    rei "Можеш зайти, двері відкриті."
    empty "*ви заходите і бачите Рей*"

    show chap1_2_2_1 
    pause 2

    show chap1_2_2_2

    mc "Вау, ваша кімната в гуртожитку виглядає набагато краще, ніж моя квартира."
    rei "Дякую, ти прийшов підготуватись до тесту?"
    mc "По-перше, я хочу подякувати тобі за те, що погодилась допомогти мені."

    menu:

        "І по-друге, я хотів би дізнатися більше про тебе":

            $ choosevar = 1
            $ reiaff = reiaff

        "*промовчати*":

            $ choosevar = 2
            $ reiaff = reiaff

    show chap1_2_2_3

    if choosevar == 1:

        rei "Я не думаю, що моя особистість є важливою для нашої підготовки до контрольної."
        $ choosevar = 0

    elif choosevar == 2:

        rei "А по-друге?"
        $ choosevar = 0

    menu:

        "Ну я би хотів дізнатись більше про тебе..":

            $ choosevar = 1
            $ reiaff -= 5

        "Ой, не зважай":

            $ choosevar = 2
            $ reiaff = reiaff

    show chap1_2_2_4

    if choosevar == 1:

        rei "Якщо ти настоюєш, то можна почати з того, що я - Такахасі Рей, і ми навчаємось в одній групі."
        rei "A далі ми можемо перейти до біології."
        $ choosevar = 0

    elif choosevar == 2:

        rei "Тоді перейдемо до біології!"
        $ choosevar = 0

    mc "Чудово! Тоді давай почнемо з перевірки моїх знань?"

    show chap1_2_2_5

    rei "Добре, я з радістю допоможу тобі підготуватися до тесту."

    show chap1_2_2_6
    scene black with fade

    empty "*декілька годин пізніше*"
    pause 2.0
    empty "*на вулиці вже почало темніти*"

    show chap1_2_2_7
    pause 2.0

    show chap1_2_2_8

    rei "Що ж.. ніби все пройшли, тільки ще повториш ті дві теми!"
    
    menu:

        "А де мені шукати потрібну інформацію?":

            $ reiaff = reiaff

        "Дуже дякую за допомогу, але мені ж ще не видали підручники..":

            $ reiaff += 5

    show chap1_2_2_9

    rei "Здається мені, що Акане-тян обіцяла тобі дати свої нотатки, піди до неї."
    rei "Її кімната навпроти."

    scene black with fade #3_loc_akane_room

    empty "*ви подякували та попрощались з Рей*"
    pause 2.0
    empty "*ви постукали в двері які по словам Рей вели до кімнати Акане*"
    pause 2.0
    empty "*голос Акане*"
    akane "Двері відкриті, можеш заходити!"

    show chap1_2_3_1 with fade
    show chap1_2_3_2

    menu:

        "Вибач, я не відволікаю?":

            $ choosevar = 1
            $ akaneaff = akaneaff

        "Акане-тян! Можна, будь ласка, твої нотатки з біології?":

            $ choosevar = 2
            $ akaneaff += 5

    show chap1_2_3_3

    if choosevar == 1:

        akane "Ти за нотатками? Зараз пошукаю.."
        $ choosevar = 0

    elif choosevar == 2:

        akane "А? Так, зараз пошукаю.. і ще, в нас прийнято звертатись по прізвищу"
        $ choosevar = 0

    show chap1_2_3_4

    scene black with fade 

    empty "*Акане почала шукати нотатки*"
    pause 2.0
    empty "*я присів на диван*"

    show chap1_2_3_5 with fade
    show chap1_2_3_6

    menu:

        "Ого, а у вас тут кожна кімната як хороми.. Мені навіть завидно!":

            $ akaneaff = akaneaff
        
        "Кхм, а я можу підселитись до вашого гуртожитку?":

            $ akaneaff += 5

    akane "Ха-ха, ще би.. У нас елітний гуртожиток, такого мало ще де знайдеш!"

    scene chap1_2_3_7 with fade

    akane "А де ти живеш?"
    mc "Ох, я знімаю невелику квартиру біля університету, але тут в рази приємніше!"
    mc "Якщо хочеш, можеш зайти до мене і я покажу тобі."

    show chap1_2_3_8

    akane "Я.. Ого.."

    show chap1_2_3_9

    akane "Хах, та ні.. Я і так зрозуміла, про що ти"
    akane "А зараз я мушу готуватись до тесту."
    pause 2.0
    empty "*голос Юно*"
    yuno "Це хто там? Йди-но сюди.."

    show chap1_2_3_10

    scene black with fade 

    empty "*ви забрали нотатки, подякували Акане та вийшли на кухню*"
    pause 1.0
    empty "*там ви побачили Юно*"

    show chap1_2_4_1 with fade
    show chap1_2_4_2

    yuno "Це ти, я так і знала.. Зроби мені чаю, сильно захотілось."
    yuno "Ну і можеш сам випити!"
    mc "Але ж я тут вперше.."

    show chap1_2_4_3

    yuno "Ну он все. Цукру не потрібно."

    show chap1_2_4_4

    menu:

        "Ну добре, як скажеш.":

            $ yunoaff += 5

        "Я взагалі-то не люблю чай, але гаразд..":

            $ yunoaff -= 5

    show chap1_2_4_5

    scene black with fade

    empty "*ви зробили чай, та всілись за стіл*"

    show chap1_2_4_6 with fade
    show chap1_2_4_7

    mc "Ти мені тоді так і не відповіла.. Як я можу до тебе звертатись?"

    show chap1_2_4_8

    yuno "Звертатись? Хм.."

    show chap1_2_4_9

    yuno "Звертатись.. Фудзівара-сама!"

    show chap1_2_4_10
    scene black with fade

    empty "*зі своєї кімнати виходить Акане*"
    empty "*і приєднується до розмови*"

    show chap1_2_4_11
    show chap1_2_4_12

    mc "І як тобі чай, Фудзівара-сама?"

    show chap1_2_4_13 with fade

    akane "Фудзівара-сама? Ха-ха-ха, дотепно, Юно-сан.."

    show chap1_2_4_14 with fade

    yuno "Тц. Ішіто-тян, ти теж хочеш чаю? [mc_name] зроби і їй."

    show chap1_2_4_15 with fade

    akane "Та ні, не потрібно."
    akane "А ти непогано влаштувалась."

    show chap1_2_4_16
    scene black with fade
    
    empty "*в гуртожиток заходить Аюмі*"
    empty "*здивовано дивлячись на події в кухні*"

    show chap1_2_4_17 with fade
    show chap1_2_4_18

    ayumi "Ого, ви всі тут!! "

    show chap1_2_4_19 with fade

    yuno "Повернулась. Все гаразд?"

    show chap1_2_4_20 with fade

    ayumi "Так!! А ви чим займаєтесь? Як пройшов день? Як підготовка, [mc_name]?"

    show chap1_2_4_21 with fade

    yuno "Не знаю хто як, але Ішіто-тян здається гарно провела час з новеньким."

    show chap1_2_4_23 with fade

    akane "Ну почнемо з того, що це не так."
    akane "А закінчимо тим, що підслуховувати невиховано."

    show chap1_2_4_24 with fade

    yuno "Ну гарно чи ні, вирішуй сама, а я піду!"

    show chap1_2_4_25

    scene black with fade

    empty "*Юно пішла до своєї кімнати*"
    empty "явно не в найкращому настрою..."

    show chap1_2_4_26

    ayumi "Що ж, то ти підготувався?"
    mc "Так!"

    show chap1_2_4_26
    
    menu:

        "Особливо я вдячний Рей, через витрачений час!":

            $ ayumiaff += 5

        "Особливо я вдячний Акан.. тобто, Ішіто-тян, за її нотатки!":
            $ ayumiaff -=5

    show chap1_2_4_28

    akane "А якщо використати спритність рук та мої нотатки - можна більше не готуватись.."

    show chap1_2_4_29

    ayumi "Це вже крайнощі.. Що ж, [mc_name], вже пізно, а завтра в нас тест, на ньому і побачимось!"

    show chap1_2_4_30

    scene black with fade 

    empty "після реакції Аюмі всі засміялись"
    pause 1.0
    empty "ви подумали, що вже пізно і пора б прощатись"
    pause 1.0
    empty "*попрощавшись, і ще раз подякувавши всім ви пішли до дому*"

label chapter1_3:

    scene black with fade

